{"annotation_text": ["<a href=\"https://www.aclweb.org/anthology/2020.wmt-1.2\">Findings of the First Shared Task on Lifelong Learning Machine Translation (Barrault, Loïc and Biesialska, Magdalena and Costa-jussà, Marta R. and Bougares, Fethi and Galibert, Olivier)</a>", "<a href=\"http://arxiv.org/abs/2006.01945\">Continual Learning of Predictive Models in Video Sequences via Variational Autoencoders (Campo, Damian and Slavic, Giulia and Baydoun, Mohamad and Marcenaro, Lucio and Regazzoni, Carlo)</a>", "<a href=\"http://arxiv.org/abs/2003.13296\">Unsupervised Model Personalization While Preserving Privacy and Scalability: An Open Problem (De Lange, Matthias and Jia, Xu and Parisot, Sarah and Leonardis, Ales and Slabaugh, Gregory and Tuytelaars, Tinne)</a>", "<a href=\"https://arxiv.org/abs/2005.04288\">Incremental Learning for End-to-End Automatic Speech Recognition (Fu, Li and Li, Xiaoxiao and Zi, Libo)</a>", "<a href=\"http://arxiv.org/abs/2006.10909\">Neural Topic Modeling with Continual Lifelong Learning (Gupta, Pankaj and Chaudhary, Yatin and Runkler, Thomas and Schütze, Hinrich)</a>", "<a href=\"http://arxiv.org/abs/2004.09578\">CLOPS: Continual Learning of Physiological Signals (Kiyasseh, Dani and Zhu, Tingting and Clifton, David A)</a>", "<a href=\"http://arxiv.org/abs/2001.05922\">Continual Learning for Domain Adaptation in Chest X-Ray Classification (Lenga, Matthias and Schulz, Heinrich and Saalbach, Axel)</a>", "<a href=\"http://arxiv.org/abs/2007.01189\">Sequential Domain Adaptation through Elastic Weight Consolidation for Sentiment Analysis (Madasu, Avinash and Rao, Vijjini Anvesh)</a>", "<a href=\"http://arxiv.org/abs/2005.00079\">Importance Driven Continual Learning for Segmentation Across Domains (Özgün, Sinan Özgür and Rickmann, Anne-Marie and Roy, Abhijit Guha and Wachinger, Christian)</a>", "<a href=\"https://openreview.net/forum?id=Skgxcn4YDS\">LAMOL: LAnguage MOdeling for Lifelong Language Learning (Sun, Fan-Keng and Ho, Cheng-Hao and Lee, Hung-Yi)</a>", "<a href=\"http://arxiv.org/abs/1903.00058\">Non-Parametric Adaptation for Neural Machine Translation (Bapna, Ankur and Firat, Orhan)</a>", "<a href=\"http://arxiv.org/abs/1906.01076\">Episodic Memory in Lifelong Language Learning (D'Autume, Cyprien de Masson and Ruder, Sebastian and Kong, Lingpeng and Yogatama, Dani)</a>", "<a href=\"http://arxiv.org/abs/1911.09896\">Continual Adaptation for Efficient Machine Communication (Hawkins, Robert D and Kwon, Minae and Sadigh, Dorsa and Goodman, Noah D)</a>", "<a href=\"http://arxiv.org/abs/1904.09187\">Continual Learning for Sentence Representations Using Conceptors (Liu, Tianlin and Ungar, Lyle and Sedoc, João)</a>", "<a href=\"http://arxiv.org/abs/1907.13295 https://www.aclweb.org/anthology/W19-5903\">Lifelong and Interactive Learning of Factual Knowledge in Dialogues (Mazumder, Sahisnu and Liu, Bing and Wang, Shuai and Ma, Nianzu)</a>", "<a href=\"http://arxiv.org/abs/1911.04489\">Making Good on LSTMs' Unfulfilled Promise (Philps, Daniel and d'Avila Garcez, Artur and Weyde, Tillman)</a>", "<a href=\"https://www.aclweb.org/anthology/N19-1209\">Overcoming Catastrophic Forgetting During Domain Adaptation of Neural Machine Translation (Thompson, Brian and Gwinnup, Jeremy and Khayrallah, Huda and Duh, Kevin and Koehn, Philipp)</a>", "<a href=\"https://ieeexplore.ieee.org/document/8662768/\">Lifelong Learning for Scene Recognition in Remote Sensing Images (Zhai, Min and Liu, Huaping and Sun, Fuchun)</a>", "<a href=\"http://arxiv.org/abs/1811.02496\">Towards Continual Learning in Medical Imaging (Baweja, Chaitanya and Glocker, Ben and Kamnitsas, Konstantinos)</a>", "<a href=\"http://arxiv.org/abs/1712.09943\">Toward Continual Learning for Conversational Agents (Lee, Sungjin)</a>", "<a href=\"https://openreview.net/forum?id=Hklso24Kwr\">Continual Learning with Adaptive Weights (CLAW) (Adel, Tameem and Zhao, Han and Turner, Richard E)</a>", "<a href=\"http://arxiv.org/abs/2004.04077\">Continual Learning with Gated Incremental Memories for Sequential Data Processing (Cossu, Andrea and Carta, Antonio and Bacciu, Davide)</a>", "<a href=\"https://openreview.net/forum?id=8xeBUgD8u9\">Continual Learning in Recurrent Neural Networks (Ehret, Benjamin and Henning, Christian and Cervera, Maria and Meulemans, Alexander and Oswald, Johannes Von and Grewe, Benjamin F.)</a>", "<a href=\"http://arxiv.org/abs/2004.10098\">Bayesian Nonparametric Weight Factorization for Continual Learning (Mehta, Nikhil and Liang, Kevin J and Carin, Lawrence)</a>", "<a href=\"http://arxiv.org/abs/2007.07617\">SpaceNet: Make Free Space For Continual Learning (Sokar, Ghada and Mocanu, Decebal Constantin and Pechenizkiy, Mykola)</a>", "<a href=\"http://arxiv.org/abs/2012.12631\">Efficient Continual Learning with Modular Networks and Task-Driven Priors (Veniat, Tom and Denoyer, Ludovic and Ranzato, Marc'Aurelio)</a>", "<a href=\"https://openreview.net/forum?id=BkepbpNFwr\">Progressive Memory Banks for Incremental Domain Adaptation (Asghar, Nabiha and Mou, Lili and Selby, Kira A and Pantasdo, Kevin D and Poupart, Pascal and Jiang, Xin)</a>", "<a href=\"https://epubs.siam.org/doi/10.1137/1.9781611975673.75\">Autonomous Deep Learning: Continual Learning Approach for Dynamic Environments (Ashfahani, Andri and Pratama, Mahardhika)</a>", "<a href=\"http://papers.nips.cc/paper/9518-compacting-picking-and-growing-for-unforgetting-continual-learning.pdf\">Compacting, Picking and Growing for Unforgetting Continual Learning (Hung, Steven C Y and Tu, Cheng-Hao and Wu, Cheng-En and Chen, Chien-Hung and Chan, Yi-Ming and Chen, Chu-Song)</a>", "<a href=\"https://arxiv.org/pdf/1904.00310.pdf\">Learn to Grow: A Continual Structure Learning Framework for Overcoming Catastrophic Forgetting (Li, Xilai and Zhou, Yingbo and Wu, Tianfu and Socher, Richard and Xiong, Caiming)</a>", "<a href=\"http://arxiv.org/abs/1907.10772\">Towards AutoML in the Presence of Drift: First Results (Madrid, Jorge G. and Escalante, Hugo Jair and Morales, Eduardo F. and Tu, Wei-Wei and Yu, Yang and Sun-Hosoya, Lisheng and Guyon, Isabelle and Sebag, Michele)</a>", "<a href=\"https://papers.nips.cc/paper/8981-continual-unsupervised-representation-learning.pdf\">Continual Unsupervised Representation Learning (Rao, Dushyant and Visin, Francesco and Rusu, Andrei A and Teh, Yee Whye and Pascanu, Razvan and Hadsell, Raia)</a>", "<a href=\"https://www.aclweb.org/anthology/D19-1126.pdf\">A Progressive Model to Enable Continual Learning for Semantic Slot Filling (Shen, Yilin and Zeng, Xiangyu and Jin, Hongxia)</a>", "<a href=\"http://arxiv.org/abs/1907.09695\">Adaptive Compression-Based Lifelong Learning (Srivastava, Shivangi and Berman, Maxim and Blaschko, Matthew B and Tuia, Devis)</a>", "<a href=\"https://ieeexplore.ieee.org/document/8999083/\">Frosting Weights for Better Continual Training (Zhu, Xiaofeng and Liu, Feng and Trajcevski, Goce and Wang, Dingding)</a>", "<a href=\"http://openaccess.thecvf.com/content_cvpr_2018/html/Gidaris_Dynamic_Few-Shot_Visual_CVPR_2018_paper.html\">Dynamic Few-Shot Visual Learning Without Forgetting (Gidaris, Spyros and Komodakis, Nikos)</a>", "<a href=\"http://papers.nips.cc/paper/8086-houdini-lifelong-learning-as-program-synthesis.pdf\">HOUDINI: Lifelong Learning as Program Synthesis (Valkov, Lazar and Chaudhari, Dipak and Srivastava, Akash and Sutton, Charles and Chaudhuri, Swarat)</a>", "<a href=\"http://papers.nips.cc/paper/7369-reinforced-continual-learning\">Reinforced Continual Learning (Xu, Ju and Zhu, Zhanxing)</a>", "<a href=\"https://arxiv.org/abs/1708.01547\">Lifelong Learning With Dynamically Expandable Networks (Yoon, Jaehong and Yang, Eunho and Lee, Jeongtae and Hwang, Sung Ju)</a>", "<a href=\"http://arxiv.org/abs/1611.06194\">Expert Gate: Lifelong Learning with a Network of Experts (Aljundi, Rahaf and Chakravarty, Punarjay and Tuytelaars, Tinne)</a>", "<a href=\"https://www.osti.gov/biblio/1424868\">Neurogenesis Deep Learning (Draelos, Timothy John and Miner, Nadine E and Lamb, Christopher and Cox, Jonathan A and Vineyard, Craig Michael and Carlson, Kristofor David and Severa, William Mark and James, Conrad D and Aimone, James Bradley)</a>", "<a href=\"http://arxiv.org/abs/1511.05641\">Net2Net: Accelerating Learning via Knowledge Transfer (Chen, Tianqi and Goodfellow, Ian and Shlens, Jonathon)</a>", "<a href=\"https://core.ac.uk/reader/84859350\">Continual Learning through Evolvable Neural Turing Machines (Luders, Benno and Schlager, Mikkel and Risi, Sebastian)</a>", "<a href=\"http://arxiv.org/abs/1606.04671\">Progressive Neural Networks (Rusu, Andrei A and Rabinowitz, Neil C and Desjardins, Guillaume and Soyer, Hubert and Kirkpatrick, James and Kavukcuoglu, Koray and Pascanu, Razvan and Hadsell, Raia)</a>", "<a href=\"http://lpp.psycho.univ-paris5.fr/feel\">Knowledge Transfer in Deep Block-Modular Neural Networks (Terekhov, Alexander V. and Montone, Guglielmo and O'Regan, J. Kevin)</a>", "<a href=\"https://linkinghub.elsevier.com/retrieve/pii/S0893608002000783\">A Self-Organising Network That Grows When Required (Marsland, Stephen and Shapiro, Jonathan and Nehmzow, Ulrich)</a>", "<a href=\"http://arxiv.org/abs/2004.11967\">Defining Benchmarks for Continual Few-Shot Learning (Antoniou, Antreas and Patacchiola, Massimiliano and Ochal, Mateusz and Storkey, Amos)</a>", "<a href=\"https://arxiv.org/abs/2004.03340v2\">Evaluating Online Continual Learning with CALM (Kruszewski, Germán and Sorodoc, Ionut-Teodor and Mikolov, Tomas)</a>", "<a href=\"https://openaccess.thecvf.com/content_CVPRW_2020/html/w15/Lomonaco_Continual_Reinforcement_Learning_in_3D_Non-Stationary_Environments_CVPRW_2020_paper.html\">Continual Reinforcement Learning in 3D Non-Stationary Environments (Lomonaco, Vincenzo and Desai, Karan and Culurciello, Eugenio and Maltoni, Davide)</a>", "<a href=\"http://arxiv.org/abs/1911.06487\">OpenLORIS-Object: A Robotic Vision Dataset and Benchmark for Lifelong Deep Learning (She, Qi and Feng, Fan and Hao, Xinyue and Yang, Qihan and Lan, Chuanlin and Lomonaco, Vincenzo and Shi, Xuesong and Wang, Zhengwei and Guo, Yao and Zhang, Yimin and Qiao, Fei and Chan, Rosa H M)</a>", "<a href=\"http://proceedings.mlr.press/v78/lomonaco17a.html\">CORe50: A New Dataset and Benchmark for Continuous Object Recognition (Lomonaco, Vincenzo and Maltoni, Davide)</a>", "<a href=\"https://www.frontiersin.org/article/10.3389/fnins.2020.00007/full\">Controlled Forgetting: Targeted Stimulation and Dopaminergic Plasticity Modulation for Unsupervised Lifelong Learning in Spiking Neural Networks (Allred, Jason M. and Roy, Kaushik)</a>", "<a href=\"https://openaccess.thecvf.com/content_CVPRW_2020/html/w15/Ayub_Cognitively-Inspired_Model_for_Incremental_Learning_Using_a_Few_Examples_CVPRW_2020_paper.html\">Cognitively-Inspired Model for Incremental Learning Using a Few Examples (Ayub, A. and Wagner, A. R.)</a>", "<a href=\"https://arxiv.org/abs/2007.06637 http://arxiv.org/abs/2007.06637\">Storing Encoded Episodes as Concepts for Continual Learning (Ayub, Ali and Wagner, Alan R.)</a>", "<a href=\"http://arxiv.org/abs/1908.08655\">Spiking Neural Predictive Coding for Continual Learning from Data Streams (Ororbia, Alexander)</a>", "<a href=\"https://baicsworkshop.github.io/pdf/BAICS_8.pdf\">Brain-like Replay for Continual Learning with Artificial Neural Networks (van de Ven, Gido M. and Siegelmann, Hava T. and Tolias, Andreas S.)</a>", "<a href=\"https://openreview.net/forum?id=Bkxbrn0cYX\">Selfless Sequential Learning (Aljundi, Rahaf and Rohrbach, Marcus and Tuytelaars, Tinne)</a>", "<a href=\"https://openreview.net/pdf?id=r1lrAiA5Ym\">Backpropamine: Training Self-Modifying Neural Networks with Differentiable Neuromodulated Plasticity (Miconi, Thomas and Rawal, Aditya and Clune, Jeff and Stanley, Kenneth O)</a>", "<a href=\"http://arxiv.org/abs/1810.07411\">Continual Learning of Recurrent Neural Networks by Locally Aligning Distributed Representations (Ororbia, Alexander and Mali, Ankur and Giles, C Lee and Kifer, Daniel)</a>", "<a href=\"http://arxiv.org/abs/1905.10696\">Lifelong Neural Predictive Coding: Sparsity Yields Less Forgetting When Learning Cumulatively (Ororbia, Alexander and Mali, Ankur and Kifer, Daniel and Giles, C Lee)</a>", "<a href=\"https://openreview.net/pdf?id=SJ1Xmf-Rb\">FearNet: Brain-Inspired Model for Incremental Learning (Kemker, Ronald and Kanan, Christopher)</a>", "<a href=\"http://proceedings.mlr.press/v80/miconi18a.html\">Differentiable Plasticity: Training Plastic Neural Networks with Backpropagation (Miconi, Thomas and Stanley, Kenneth and Clune, Jeff)</a>", "<a href=\"https://www.frontiersin.org/articles/10.3389/fnbot.2018.00078/full\">Lifelong Learning of Spatiotemporal Representations With Dual-Memory Recurrent Self-Organization (Parisi, German I and Tani, Jun and Weber, Cornelius and Wermter, Stefan)</a>", "<a href=\"https://arxiv.org/abs/1701.06106\">Neurogenesis-Inspired Dictionary Learning: Online Model Adaption in a Changing World (Garg, Sahil and Rish, Irina and Cecchi, Guillermo and Lozano, Aurelie)</a>", "<a href=\"http://arxiv.org/abs/1705.07241 http://dx.doi.org/10.1371/journal.pone.0187736\">Diffusion-Based Neuromodulation Can Eliminate Catastrophic Forgetting in Simple Neural Networks (Velez, Roby and Clune, Jeff)</a>", "<a href=\"http://arxiv.org/abs/1601.00720\">How Do Neurons Operate on Sparse Distributed Representations? A Mathematical Theory of Sparsity, Neurons and Active Dendrites (Ahmad, Subutai and Hawkins, Jeff)</a>", "<a href=\"https://doi.org/10.1162/NECO_a_00893\">Continuous Online Sequence Learning with an Unsupervised Neural Network Model (Cui, Yuwei and Ahmad, Subutai and Hawkins, Jeff)</a>", "<a href=\"http://ieeexplore.ieee.org/document/6707047/\">Mitigation of Catastrophic Forgetting in Recurrent Neural Networks Using a Fixed Expansion Layer (Coop, Robert and Arel, Itamar)</a>", "<a href=\"http://papers.nips.cc/paper/5059-compete-to-compute.pdf\">Compete to Compute (Srivastava, Rupesh Kumar and Masci, Jonathan and Kazerounian, Sohrob and Gomez, Faustino and Schmidhuber, Jürgen)</a>", "<a href=\"http://ieeexplore.ieee.org/document/6292123/\">Mitigation of Catastrophic Interference in Neural Networks Using a Fixed Expansion Layer (Coop, Robert and Arel, Itamar)</a>", "<a href=\"https://www.nature.com/articles/nn1100_1178\">Synaptic Plasticity: Taming the Beast (Abbott, L F and Nelson, Sacha B)</a>", "<a href=\"https://openaccess.thecvf.com/content_CVPR_2020/papers/Davidson_Sequential_Mastery_of_Multiple_Visual_Tasks_Networks_Naturally_Learn_to_CVPR_2020_paper.pdf\">Sequential Mastery of Multiple Visual Tasks: Networks Naturally Learn to Learn and Forget to Forget (Davidson, Guy and Mozer, Michael C)</a>", "<a href=\"http://arxiv.org/abs/2001.01578\">Dissecting Catastrophic Forgetting in Continual Learning by Deep Visualization (Nguyen, Giang and Chen, Shuan and Do, Thao and Jun, Tae Joon and Choi, Ho-Jin and Kim, Daeyoung)</a>", "<a href=\"http://arxiv.org/abs/1908.01091\">Toward Understanding Catastrophic Forgetting in Continual Learning (Nguyen, Cuong V and Achille, Alessandro and Lam, Michael and Hassner, Tal and Mahadevan, Vijay and Soatto, Stefano)</a>", "<a href=\"https://openreview.net/forum?id=BJlxm30cKm\">An Empirical Study of Example Forgetting during Deep Neural Network Learning (Toneva, Mariya and Sordoni, Alessandro and des Combes, Remi Tachet and Trischler, Adam and Bengio, Yoshua and Gordon, Geoffrey J)</a>", "<a href=\"http://arxiv.org/abs/1906.02568\">Localizing Catastrophic Forgetting in Neural Networks (Wiewel, Felix and Yang, Bin)</a>", "<a href=\"http://arxiv.org/abs/1810.13166\">Don't Forget, There Is More than Forgetting: New Metrics for Continual Learning (Díaz-Rodr\\ǵuez, Natalia and Lomonaco, Vincenzo and Filliat, David and Maltoni, Davide)</a>", "<a href=\"https://psycnet.apa.org/record/1980-06768-001\">How Does a Brain Build a Cognitive Code? (Grossberg, Stephen)</a>", "<a href=\"https://www.amazon.com/Organization-Behavior-Neuropsychological-Theory/dp/0805843000 https://books.google.it/books/about/The_Organization_of_Behavior.html?id=ddB4AgAAQBAJ&printsec=frontcover&source=kp_read_button&redir_esc=y#v=onepage&q&f=false\">The Organization of Behavior: A Neuropsychological Theory (Hebb, D O)</a>", "<a href=\"http://www.tandfonline.com/doi/abs/10.1080/095400997116595\">Pseudo-Recurrent Connectionist Networks: An Approach to the 'Sensitivity-Stability' Dilemma (French, Robert)</a>", "<a href=\"https://doi.org/10.1023/A:1007331723572\">CHILD: A First Step Towards Continual Learning (Ring, Mark B)</a>", "<a href=\"https://doi.org/10.1007/BF00116900 http://link.springer.com/10.1007/BF00116900\">Learning in the Presence of Concept Drift and Hidden Contexts (Widmer, Gerhard and Kubat, Miroslav)</a>", "<a href=\"https://www.aaai.org/Papers/Symposia/Spring/1993/SS-93-06/SS93-06-007.pdf\">Using Semi-Distributed Representations to Overcome Catastrophic Forgetting in Connectionist Networks (French, Robert)</a>", "<a href=\"https://ieeexplore.ieee.org/document/33\">The ART of Adaptive Pattern Recognition by a Self-Organizing Neural Network (Carpenter, Gail A. and Grossberg, Stephen)</a>", "<a href=\"https://psycnet.apa.org/record/1980-06768-001\">How Does a Brain Build a Cognitive Code? (Grossberg, Stephen)</a>", "<a href=\"http://arxiv.org/abs/2004.11967\">Defining Benchmarks for Continual Few-Shot Learning (Antoniou, Antreas and Patacchiola, Massimiliano and Ochal, Mateusz and Storkey, Amos)</a>", "<a href=\"http://arxiv.org/abs/2008.00819\">Tell Me What This Is: Few-Shot Incremental Object Learning by a Robot (Ayub, Ali and Wagner, Alan R.)</a>", "<a href=\"https://arxiv.org/abs/2007.13904\">La-MAML: Look-Ahead Meta Learning for Continual Learning (Gupta, Gunshi and Yadav, Karmesh and Paull, Liam)</a>", "<a href=\"https://openaccess.thecvf.com/content_CVPR_2020/html/Rajasegaran_iTAML_An_Incremental_Task-Agnostic_Meta-learning_Approach_CVPR_2020_paper.html\">iTAML: An Incremental Task-Agnostic Meta-Learning Approach (Rajasegaran, Jathushan and Khan, Salman and Hayat, Munawar and Khan, Fahad Shahbaz and Shah, Mubarak)</a>", "<a href=\"https://arxiv.org/abs/2007.04546\">Wandering within a World: Online Contextualized Few-Shot Learning (Ren, Mengye and Iuzzolino, Michael L and Mozer, Michael C and Zemel, Richard S)</a>", "<a href=\"https://arxiv.org/abs/2004.10956\">Few-Shot Class-Incremental Learning (Tao, X. and X., Hong and Chang, X. and Dong, S. and Wei, X. and Gong, Y.)</a>", "<a href=\"https://arxiv.org/abs/2006.15524\">Few-Shot Class-Incremental Learning via Feature Space Composition (Zhao, H. and Fu, Y. and Li, X. and Li, S. and Omar, B. and Li, X.)</a>", "<a href=\"http://arxiv.org/abs/2003.05856\">Online Fast Adaptation and Knowledge Accumulation: A New Approach to Continual Learning (Caccia, Massimo and Rodriguez, Pau and Ostapenko, Oleksiy and Normandin, Fabrice and Lin, Min and Caccia, Lucas and Laradji, Issam and Rish, Irina and Lacoste, Alexande and Vazquez, David and Charlin, Laurent)</a>", "<a href=\"https://arxiv.org/abs/1912.08866\">Continuous Meta-Learning without Tasks (Harrison, James and Sharma, Apoorva and Finn, Chelsea and Pavone, Marco)</a>", "<a href=\"http://arxiv.org/abs/1906.05201\">Task Agnostic Continual Learning via Meta Learning (He, Xu and Sygnowski, Jakub and Galashov, Alexandre and Rusu, Andrei A and Teh, Yee Whye and Pascanu, Razvan)</a>", "<a href=\"http://papers.nips.cc/paper/9112-reconciling-meta-learning-and-continual-learning-with-online-mixtures-of-tasks\">Reconciling Meta-Learning and Continual Learning with Online Mixtures of Tasks (Jerfel, Ghassen and Grant, Erin and Griffiths, Tom and Heller, Katherine A)</a>", "<a href=\"http://arxiv.org/abs/1904.03178\">Reducing Catastrophic Forgetting When Evolving Neural Networks (Early, Joseph)</a>", "<a href=\"https://papers.nips.cc/paper/8806-a-meta-mdp-approach-to-exploration-for-lifelong-reinforcement-learning.pdf\">A Meta-MDP Approach to Exploration for Lifelong Reinforcement Learning (Garcia, Francisco M and Thomas, Philip S)</a>", "<a href=\"http://arxiv.org/abs/1902.00255\">Policy Consolidation for Continual Reinforcement Learning (Kaplanis, Christos and Shanahan, Murray and Clopath, Claudia)</a>", "<a href=\"http://link.springer.com/10.1007/978-3-030-30493-5_4\">Continual Learning Exploiting Structure of Fractal Reservoir Computing (Kobayashi, Taisuke and Sugino, Toshiki)</a>", "<a href=\"https://arxiv.org/abs/1812.07671\">Deep Online Learning via Meta-Learning: Continual Adaptation for Model-Based RL (Nagabandi, Anusha and Finn, Chelsea and Levine, Sergey)</a>", "<a href=\"http://arxiv.org/abs/1911.08068\">Leaky Tiling Activations: A Simple Approach to Learning Sparse Representations Online (Pan, Yangchen and Banman, Kirby and White, Martha)</a>", "<a href=\"https://openreview.net/pdf?id=B1gTShAct7\">Learning to Learn without Forgetting by Maximizing Transfer and Minimizing Interference (Riemer, Matthew and Cases, Ignacio and Ajemian, Robert and Liu, Miao and Rish, Irina and Tu, Yuhai and Tesauro, Gerald)</a>", "<a href=\"http://papers.nips.cc/paper/8327-experience-replay-for-continual-learning.pdf\">Experience Replay for Continual Learning (Rolnick, David and Ahuja, Arun and Schwarz, Jonathan and Lillicrap, Timothy P and Wayne, Greg)</a>", "<a href=\"http://arxiv.org/abs/1802.10269\">Selective Experience Replay for Lifelong Learning (Isele, David and Cosgun, Akansel)</a>", "<a href=\"http://arxiv.org/abs/1802.07239\">Continual Reinforcement Learning with Complex Synapses (Kaplanis, Christos and Shanahan, Murray and Clopath, Claudia)</a>", "<a href=\"http://arxiv.org/abs/1802.08294\">Unicorn: Continual Learning with a Universal, Off-Policy Agent (Mankowitz, Daniel J and Žídek, Augustin and Barreto, André and Horgan, Dan and Hessel, Matteo and Quan, John and Oh, Junhyuk and van Hasselt, Hado and Silver, David and Schaul, Tom)</a>", "<a href=\"http://papers.nips.cc/paper/7702-lifelong-inverse-reinforcement-learning.pdf\">Lifelong Inverse Reinforcement Learning (Mendez, Jorge A and Shivkumar, Shashank and Eaton, Eric)</a>", "<a href=\"http://proceedings.mlr.press/v80/schwarz18a.html\">Progress & Compress: A Scalable Framework for Continual Learning (Schwarz, Jonathan and Czarnecki, Wojciech and Luketina, Jelena and Grabska-Barwinska, Agnieszka and Teh, Yee Whye and Pascanu, Razvan and Hadsell, Raia)</a>", "<a href=\"http://arxiv.org/abs/1612.00796\">Overcoming Catastrophic Forgetting in Neural Networks (Kirkpatrick, James and Pascanu, Razvan and Rabinowitz, Neil and Veness, Joel and Desjardins, Guillaume and Rusu, Andrei A and Milan, Kieran and Quan, John and Ramalho, Tiago and Grabska-Barwinska, Agnieszka and Hassabis, Demis and Clopath, Claudia and Kumaran, Dharshan and Hadsell, Raia)</a>", "<a href=\"https://sites.ualberta.ca/ amw8/cldl.pdf\">Stable Predictive Representations with General Value Functions for Continual Learning (Schlegel, Matthew and White, Adam and White, Martha)</a>", "<a href=\"https://core.ac.uk/reader/84859350\">Continual Learning through Evolvable Neural Turing Machines (Luders, Benno and Schlager, Mikkel and Risi, Sebastian)</a>", "<a href=\"http://arxiv.org/abs/1606.04671\">Progressive Neural Networks (Rusu, Andrei A and Rabinowitz, Neil C and Desjardins, Guillaume and Soyer, Hubert and Kirkpatrick, James and Kavukcuoglu, Koray and Pascanu, Razvan and Hadsell, Raia)</a>", "<a href=\"http://www.ncbi.nlm.nih.gov/pubmed/29756130 http://www.pubmedcentral.nih.gov/articlerender.fcgi?artid=PMC5947972\">Lifelong-RL: Lifelong Relaxation Labeling for Separating Entities and Aspects in Opinion Targets. (Shu, Lei and Liu, Bing and Xu, Hu and Kim, Annice)</a>", "<a href=\"https://doi.org/10.1023/A:1007331723572\">CHILD: A First Step Towards Continual Learning (Ring, Mark B)</a>", "<a href=\"http://arxiv.org/abs/2004.04077\">Continual Learning with Gated Incremental Memories for Sequential Data Processing (Cossu, Andrea and Carta, Antonio and Bacciu, Davide)</a>", "<a href=\"https://arxiv.org/abs/2009.00919\">Continual Prototype Evolution: Learning Online from Non-Stationary Data Streams (De Lange, Matthias and Tuytelaars, Tinne)</a>", "<a href=\"https://proceedings.neurips.cc/paper/2020/file/a576eafbce762079f7d1f77fca1c5cc2-Paper.pdf\">Organizing Recurrent Network Dynamics by Task-Computation to Enable Continual Learning (Duncker, Lea and Driscoll, Laura N and Shenoy, Krishna V and Sahani, Maneesh and Sussillo, David)</a>", "<a href=\"http://arxiv.org/abs/1909.01520\">Lifelong Machine Learning with Deep Streaming Linear Discriminant Analysis (Hayes, Tyler L and Kanan, Christopher)</a>", "<a href=\"http://arxiv.org/abs/2010.00352\">Meta-Consolidation for Continual Learning (Joseph, K J and Balasubramanian, Vineeth N)</a>", "<a href=\"https://iclr.cc/virtual_2020/poster_SJlsFpVtDB.html\">Continual Learning with Bayesian Neural Networks for Non-Stationary Data (Kurle, Richard and Cseke, Botond and Klushyn, Alexej and van der Smagt, Patrick and Günnemann, Stephan)</a>", "<a href=\"https://iclr.cc/virtual_2020/poster_rklnDgHtDS.html\">Compositional Language Continual Learning (Li, Yuanpeng and Zhao, Liang and Church, Kenneth and Elhoseiny, Mohamed)</a>", "<a href=\"http://arxiv.org/abs/2003.09114\">Online Continual Learning on Sequences (Parisi, German I and Lomonaco, Vincenzo)</a>", "<a href=\"http://papers.nips.cc/paper/9357-online-continual-learning-with-maximal-interfered-retrieval.pdf\">Online Continual Learning with Maximal Interfered Retrieval (Aljundi, Rahaf and Belilovsky, Eugene and Tuytelaars, Tinne and Charlin, Laurent and Caccia, Massimo and Lin, Min and Page-Caccia, Lucas)</a>", "<a href=\"http://arxiv.org/abs/1812.00420\">Efficient Lifelong Learning with A-GEM (Chaudhry, Arslan and Ranzato, Marc'Aurelio and Rohrbach, Marcus and Elhoseiny, Mohamed)</a>", "<a href=\"http://arxiv.org/abs/1906.05201\">Task Agnostic Continual Learning via Meta Learning (He, Xu and Sygnowski, Jakub and Galashov, Alexandre and Rusu, Andrei A and Teh, Yee Whye and Pascanu, Razvan)</a>", "<a href=\"http://link.springer.com/10.1007/978-3-030-30484-3_56\">A Study on Catastrophic Forgetting in Deep LSTM Networks (Schak, Monika and Gepperth, Alexander)</a>", "<a href=\"http://arxiv.org/abs/1904.02021\">Unsupervised Progressive Learning and the STAM Architecture (Smith, James and Baer, Seth and Taylor, Cameron and Dovrolis, Constantine)</a>", "<a href=\"https://doi.org/10.1162/neco_a_01246\">Toward Training Recurrent Neural Networks for Lifelong Learning (Sodhani, Shagun and Chandar, Sarath and Bengio, Yoshua)</a>", "<a href=\"https://openreview.net/pdf?id=B1al7jg0b\">Overcoming Catastrophic Interference Using Conceptor-Aided Backpropagation (He, Xu and Jaeger, Herbert)</a>", "<a href=\"https://arxiv.org/abs/1706.08840\">Gradient Episodic Memory for Continual Learning (Lopez-Paz, David and Ranzato, Marc'Aurelio)</a>", "<a href=\"https://doi.org/10.1080/09540090412331271199\">Self-Refreshing Memory in Artificial Neural Networks: Learning Temporal Sequences without Catastrophic Forgetting (Ans, Bernard and Rousset, Stéphane and French, Robert M. and Musca, Serban)</a>", "<a href=\"http://leadserv.u-bourgogne.fr/IMG/pdf/psdnet1.pdf\">Using Pseudo-Recurrent Connectionist Networks to Solve the Problem of Sequential Learning (French, Robert)</a>", "<a href=\"http://arxiv.org/abs/2007.00487\">Continual Learning: Tackling Catastrophic Forgetting in Deep Neural Networks with Replay Processes (Lesort, Timoth'ee)</a>", "<a href=\"https://arxiv.org/abs/1910.02718\">Continual Learning in Neural Networks (Aljundi, Rahaf)</a>", "<a href=\"http://researchbank.rmit.edu.au/eserv/rmit:162646/Fayek.pdf\">Continual Deep Learning via Progressive Learning (Fayek, Haytham M.)</a>", "<a href=\"http://amsdottorato.unibo.it/9073/\">Continual Learning with Deep Architectures (Lomonaco, Vincenzo)</a>", "<a href=\"https://www.springer.com/gp/book/9780792397168\">Explanation-Based Neural Network Learning: A Lifelong Learning Approach (Thrun, Sebastian)</a>", "<a href=\"https://www.cs.utexas.edu/ ring/Ring-dissertation.pdf\">Continual Learning in Reinforcement Environments (Ring, Mark)</a>", "<a href=\"https://www.nature.com/articles/s41467-020-17866-2\">Brain-Inspired Replay for Continual Learning with Artificial Neural Networks (van de Ven, Gido M. and Siegelmann, Hava T. and Tolias, Andreas S.)</a>", "<a href=\"http://arxiv.org/abs/1903.04566\">Complementary Learning for Overcoming Catastrophic Forgetting Using Experience Replay (Rostami, Mohammad and Kolouri, Soheil and Pilly, Praveen K)</a>", "<a href=\"http://arxiv.org/abs/1906.00654\">Continual Learning of New Sound Classes Using Generative Replay (Wang, Zhepei and Subakan, Cem and Tzinis, Efthymios and Smaragdis, Paris and Charlin, Laurent)</a>", "<a href=\"https://arxiv.org/abs/1809.10635\">Generative Replay with Feedback Connections as a General Strategy for Continual Learning (van de Ven, Gido M. and Tolias, Andreas S.)</a>", "<a href=\"https://openaccess.thecvf.com/content_CVPRW_2020/html/w15/Lomonaco_Rehearsal-Free_Continual_Learning_Over_Small_Non-I.I.D._Batches_CVPRW_2020_paper.html\">Rehearsal-Free Continual Learning over Small Non-I.I.D. Batches (Lomonaco, Vincenzo and Maltoni, Davide and Pellegrini, Lorenzo)</a>", "<a href=\"https://arxiv.org/abs/2010.04495\">Linear Mode Connectivity in Multitask and Continual Learning (Mirzadeh, Seyed Iman and Farajtabar, Mehrdad and Gorur, Dilan and Pascanu, Razvan and Ghasemzadeh, Hassan)</a>", "<a href=\"http://arxiv.org/abs/1905.11550\">Single-Net Continual Learning with Progressive Segmented Training (PST) (Du, Xiaocong and Charan, Gouranga and Liu, Frank and Cao, Yu)</a>", "<a href=\"http://arxiv.org/abs/1806.08568\">Continuous Learning in Single-Incremental-Task Scenarios (Maltoni, Davide and Lomonaco, Vincenzo)</a>", "<a href=\"https://doi.org/10.1162/neco_a_01246\">Toward Training Recurrent Neural Networks for Lifelong Learning (Sodhani, Shagun and Chandar, Sarath and Bengio, Yoshua)</a>", "<a href=\"http://arxiv.org/abs/1906.00654\">Continual Learning of New Sound Classes Using Generative Replay (Wang, Zhepei and Subakan, Cem and Tzinis, Efthymios and Smaragdis, Paris and Charlin, Laurent)</a>", "<a href=\"http://link.springer.com/10.1007/978-3-030-01219-9_27\">Lifelong Learning via Progressive Distillation and Retrospection (Hou, Saihui and Pan, Xinyu and Loy, Chen Change and Wang, Zilei and Lin, Dahua)</a>", "<a href=\"http://proceedings.mlr.press/v80/schwarz18a.html\">Progress & Compress: A Scalable Framework for Continual Learning (Schwarz, Jonathan and Czarnecki, Wojciech and Luketina, Jelena and Grabska-Barwinska, Agnieszka and Teh, Yee Whye and Pascanu, Razvan and Hadsell, Raia)</a>", "<a href=\"http://arxiv.org/abs/2002.09571\">Learning to Continually Learn (Beaulieu, Shawn and Frati, Lapo and Miconi, Thomas and Lehman, Joel and Stanley, Kenneth O. and Clune, Jeff and Cheney, Nick)</a>", "<a href=\"http://arxiv.org/abs/2011.07035\">Continual Learning with Deep Artificial Neurons (Camp, Blake and Mandivarapu, Jaya Krishna and Estrada, Rolando)</a>", "<a href=\"http://arxiv.org/abs/2010.00352\">Meta-Consolidation for Continual Learning (Joseph, K J and Balasubramanian, Vineeth N)</a>", "<a href=\"https://arxiv.org/abs/2008.02219\">Meta Continual Learning via Dynamic Programming (Krishnan, R and Balaprakash, Prasanna)</a>", "<a href=\"http://proceedings.mlr.press/v97/finn19a/finn19a.pdf\">Online Meta-Learning (Finn, Chelsea and Rajeswaran, Aravind and Kakade, Sham and Levine, Sergey)</a>", "<a href=\"http://papers.nips.cc/paper/8458-meta-learning-representations-for-continual-learning\">Meta-Learning Representations for Continual Learning (Javed, Khurram and White, Martha)</a>", "<a href=\"https://openreview.net/pdf?id=B1gTShAct7\">Learning to Learn without Forgetting by Maximizing Transfer and Minimizing Interference (Riemer, Matthew and Cases, Ignacio and Ajemian, Robert and Liu, Miao and Rish, Irina and Tu, Yuhai and Tesauro, Gerald)</a>", "<a href=\"https://arxiv.org/abs/1806.06928\">Meta Continual Learning (Vuorio, Risto and Cho, Dong-Yeon and Kim, Daejoong and Kim, Jiwon)</a>", "<a href=\"http://arxiv.org/abs/2003.05856\">Online Fast Adaptation and Knowledge Accumulation: A New Approach to Continual Learning (Caccia, Massimo and Rodriguez, Pau and Ostapenko, Oleksiy and Normandin, Fabrice and Lin, Min and Caccia, Lucas and Laradji, Issam and Rish, Irina and Lacoste, Alexande and Vazquez, David and Charlin, Laurent)</a>", "<a href=\"https://proceedings.icml.cc/paper/2020/file/274ad4786c3abca69fa097b85867d9a4-Paper.pdf\">Optimal Continual Learning Has Perfect Memory and Is NP-HARD (Knoblauch, Jeremias and Husain, Hisham and Diethe, Tom)</a>", "<a href=\"http://arxiv.org/abs/1912.03049\">Regularization Shortcomings for Continual Learning (Lesort, Timothée and Stoian, Andrei and Filliat, David)</a>", "<a href=\"http://link.springer.com/10.1007/978-3-030-27202-9_41\">Strategies for Improving Single-Head Continual Learning Performance (El Khatib, Alaa and Karray, Fakhri)</a>", "<a href=\"http://arxiv.org/abs/1805.09733\">Towards Robust Evaluations of Continual Learning (Farquhar, Sebastian and Gal, Yarin)</a>", "<a href=\"http://arxiv.org/abs/1904.07734\">Three Scenarios for Continual Learning (van de Ven, Gido M and Tolias, Andreas S)</a>", "<a href=\"https://www.biorxiv.org/content/10.1101/569038v1\">Can Sleep Protect Memories from Catastrophic Forgetting? (Gonzalez, Oscar C and Sokolov, Yury and Krishnan, Giri and Bazhenov, Maxim)</a>", "<a href=\"http://link.springer.com/10.1007/s11571-011-9177-6\">Synaptic Consolidation: An Approach to Long-Term Learning (Clopath, Claudia)</a>", "<a href=\"https://www.amazon.com/Organization-Behavior-Neuropsychological-Theory/dp/0805843000 https://books.google.it/books/about/The_Organization_of_Behavior.html?id=ddB4AgAAQBAJ&printsec=frontcover&source=kp_read_button&redir_esc=y#v=onepage&q&f=false\">The Organization of Behavior: A Neuropsychological Theory (Hebb, D O)</a>", "<a href=\"http://doi.apa.org/getdoi.cfm?doi=10.1037/0278-7393.26.3.601\">Negative Transfer Errors in Sequential Cognitive Skills: Strong-but-Wrong Sequence Application. (Woltz, Dan J. and Gardner, Michael K. and Bell, Brian G.)</a>", "<a href=\"http://www.ncbi.nlm.nih.gov/pubmed/2186426\">Connectionist Models of Recognition Memory: Constraints Imposed by Learning and Forgetting Functions. (Ratcliff, R)</a>", "<a href=\"https://arxiv.org/abs/2102.06253\">Continuum: Simple Management of Complex Continual Learning Scenarios (Douillard, Arthur and Lesort, Timothée)</a>", "<a href=\"https://openreview.net/forum?id=LXMSvPmsm0g\">Long Live the Lottery: The Existence of Winning Tickets in Lifelong Learning (Chen, Tianlong and Zhang, Zhenyu and Liu, Sijia and Chang, Shiyu and Wang, Zhangyang)</a>", "<a href=\"http://arxiv.org/abs/2005.05080\">Continual Learning Using Task Conditional Neural Networks (Li, Honglin and Barnaghi, Payam and Enshaeifar, Shirin and Ganz, Frieder)</a>", "<a href=\"http://arxiv.org/abs/2011.12216\">Energy-Based Models for Continual Learning (Li, Shuang and Du, Yilun and van de Ven, Gido M. and Torralba, Antonio and Mordatch, Igor)</a>", "<a href=\"http://arxiv.org/abs/2002.05347\">Continual Universal Object Detection (Liu, Xialei and Yang, Hao and Ravichandran, Avinash and Bhotika, Rahul and Soatto, Stefano)</a>", "<a href=\"http://arxiv.org/abs/2002.10211\">Mnemonics Training: Multi-Class Incremental Learning without Forgetting (Liu, Yaoyao and Liu, An-An and Su, Yuting and Schiele, Bernt and Sun, Qianru)</a>", "<a href=\"http://arxiv.org/abs/2001.08650\">Structured Compression and Sharing of Representational Space for Continual Learning (Saha, Gobinda and Garg, Isha and Ankit, Aayush and Roy, Kaushik)</a>", "<a href=\"https://openreview.net/forum?id=3AOj0RCNC2\">Gradient Projection Memory for Continual Learning (Saha, Gobinda and Roy, Kaushik)</a>", "<a href=\"http://arxiv.org/abs/2009.00647\">Lifelong Graph Learning (Wang, Chen and Qiu, Yuheng and Scherer, Sebastian)</a>", "<a href=\"http://arxiv.org/abs/1902.05522\">Superposition of Many Models into One (Cheung, Brian and Terekhov, Alex and Chen, Yubei and Agrawal, Pulkit and Olshausen, Bruno)</a>", "<a href=\"http://arxiv.org/abs/1903.05202\">Continual Learning in Practice (Diethe, Tom and Borchert, Tom and Thereska, Eno and Balle, Borja and Lawrence, Neil)</a>", "<a href=\"https://www.taylorfrancis.com/books/9781317729266/chapters/10.4324/9781315789354-58\">Dynamically Constraining Connectionist Networks to Produce Distributed, Orthogonal Representations to Reduce Catastrophic Interference (French, Robert)</a>", "<a href=\"http://arxiv.org/abs/1903.04476\">Continual Learning via Neural Pruning (Golkar, Siavash and Kagan, Michael and Cho, Kyunghyun)</a>", "<a href=\"http://arxiv.org/abs/1908.11853\">BooVAE: A Scalable Framework for Continual VAE Learning under Boosting Approach (Kuzina, Anna and Egorov, Evgenii and Burnaev, Evgeny)</a>", "<a href=\"http://arxiv.org/abs/1903.12648\">Overcoming Catastrophic Forgetting with Unlabeled Data in the Wild (Lee, Kibok and Lee, Kimin and Shin, Jinwoo and Lee, Honglak)</a>", "<a href=\"http://arxiv.org/abs/1910.04112\">Continual Learning Using Bayesian Neural Networks (Li, HongLin and Barnaghi, Payam and Enshaeifar, Shirin and Ganz, Frieder)</a>", "<a href=\"http://arxiv.org/abs/1905.12019\">Unified Probabilistic Deep Continual Learning through Generative Replay and Open Set Recognition (Mundt, Martin and Majumder, Sagnik and Pliushch, Iuliia and Hong, Yong Won and Ramesh, Visvanathan)</a>", "<a href=\"http://arxiv.org/abs/1906.12218\">Continual Rare-Class Recognition with Emerging Novel Subclasses (Nguyen, Hung and Wang, Xuejian and Akoglu, Leman)</a>", "<a href=\"http://papers.nips.cc/paper/9429-random-path-selection-for-continual-learning.pdf\">Random Path Selection for Incremental Learning (Rajasegaran, Jathushan and Hayat, Munawar and Fahad, Salman Khan and Khan, Shahbaz and Shao, Ling)</a>", "<a href=\"http://arxiv.org/abs/1905.02099\">Improving and Understanding Variational Continual Learning (Swaroop, Siddharth and Nguyen, Cuong V and Bui, Thang D and Turner, Richard E)</a>", "<a href=\"http://arxiv.org/abs/1908.00355\">Continual Learning via Online Leverage Score Sampling (Teng, Dan and Dasgupta, Sakyasingha)</a>", "<a href=\"https://ieeexplore.ieee.org/document/8666123/\">Class-Incremental Learning Based on Feature Extraction of CNN With Optimized Softmax and One-Class Classifiers (Ye, Xin and Zhu, Qiuyu)</a>", "<a href=\"http://arxiv.org/abs/1808.06508\">Life-Long Disentangled Representation Learning with Cross-Domain Latent Homologies (Achille, Alessandro and Eccles, Tom and Matthey, Loic and Burgess, Christopher P. and Watters, Nick and Lerchner, Alexander and Higgins, Irina)</a>", "<a href=\"https://doi.org/10.1007/978-3-030-01225-0_5\">Piggyback: Adapting a Single Network to Multiple Tasks by Learning to Mask Weights (Mallya, Arun and Davis, Dillon and Lazebnik, Svetlana)</a>", "<a href=\"http://arxiv.org/abs/1805.11119\">Adding New Tasks to a Single Network with Weight Transformations Using Binary Masks (Mancini, Massimiliano and Ricci, Elisa and Caputo, Barbara and Bulò, Samuel Rota)</a>", "<a href=\"https://openreview.net/forum?id=BkQqq0gRb\">Variational Continual Learning (Nguyen, Cuong V and Li, Yingzhen and Bui, Thang D and Turner, Richard E)</a>", "<a href=\"http://bayesiandeeplearning.org/2018/papers/58.pdf\">Task Agnostic Continual Learning Using Online Variational Bayes (Zeno, Chen and Golan, Itay and Hoffer, Elad and Soudry, Daniel)</a>", "<a href=\"http://arxiv.org/abs/1704.01920 http://dx.doi.org/10.1109/ICCV.2017.148\">Encoder Based Lifelong Learning (Triki, Amal Rannen and Aljundi, Rahaf and Blaschko, Mathew B. and Tuytelaars, Tinne)</a>", "<a href=\"http://link.springer.com/10.1007/978-3-319-54526-4_43\">Fine-Tuning Deep Neural Networks in Continuous Learning Scenarios (Käding, Christoph and Rodner, Erik and Freytag, Alexander and Denzler, Joachim)</a>", "<a href=\"http://arxiv.org/abs/2002.00718\">Modeling the Background for Incremental Learning in Semantic Segmentation (Cermelli, Fabio and Mancini, Massimiliano and Bulò, Samuel Rota and Ricci, Elisa and Caputo, Barbara)</a>", "<a href=\"https://arxiv.org/abs/2011.11390\">PLOP: Learning without Forgetting for Continual Semantic Segmentation (Douillard, Arthur and Chen, Yifu and Dapogny, Arnaud and Cord, Matthieu)</a>", "<a href=\"https://arxiv.org/abs/2006.13748\">Insights from the Future for Continual Learning (Douillard, Arthur and Valle, Eduardo and Ollion, Charles and Robert, Thomas and Cord, Matthieu)</a>", "<a href=\"https://arxiv.org/abs/2004.13513\">PODNet: Pooled Outputs Distillation for Small-Tasks Incremental Learning (Douillard, Arthur and Cord, Matthieu and Ollion, Charles and Robert, Thomas and Valle, Eduardo)</a>", "<a href=\"https://openreview.net/pdf?id=HklUCCVKDB\">Uncertainty-Guided Continual Learning with Bayesian Neural Networks (Ebrahimi, Sayna and Elhoseiny, Mohamed and Darrell, Trevor and Rohrbach, Marcus)</a>", "<a href=\"http://arxiv.org/abs/2004.10862\">Continual Learning of Object Instances (Parshotam, Kishan and Kilickaya, Mert)</a>", "<a href=\"http://www.sciencedirect.com/science/article/pii/S092523122030151X\">Efficient Continual Learning in Neural Networks with Embedding Regularization (Pomponi, Jary and Scardapane, Simone and Lomonaco, Vincenzo and Uncini, Aurelio)</a>", "<a href=\"https://openreview.net/forum?id=SJgwNerKvB\">Continual Learning with Hypernetworks (von Oswald, Johannes and Henning, Christian and Sacramento, João and Grewe, Benjamin F)</a>", "<a href=\"https://papers.nips.cc/paper/8690-uncertainty-based-continual-learning-with-adaptive-regularization.pdf\">Uncertainty-Based Continual Learning with Adaptive Regularization (Ahn, Hongjoon and Cha, Sungmin and Lee, Donggyu and Moon, Taesup)</a>", "<a href=\"https://openaccess.thecvf.com/content_CVPR_2019/papers/Dhar_Learning_Without_Memorizing_CVPR_2019_paper.pdf\">Learning without Memorizing (Dhar, Prithviraj and Vikram Singh, Rajat and Peng, Kuan-Chuan and Wu, Ziyan and Chellappa, Rama)</a>", "<a href=\"http://arxiv.org/abs/1907.13372\">Incremental Learning Techniques for Semantic Segmentation (Michieli, Umberto and Zanuttigh, Pietro)</a>", "<a href=\"http://arxiv.org/abs/1901.11356\">Functional Regularisation for Continual Learning Using Gaussian Processes (Titsias, Michalis K and Schwarz, Jonathan and Matthews, Alexander G de G and Pascanu, Razvan and Teh, Yee Whye)</a>", "<a href=\"https://ieeexplore.ieee.org/document/8545895/\">Rotate Your Networks: Better Weight Consolidation and Less Catastrophic Forgetting (Liu, Xialei and Masana, Marc and Herranz, Luis and Van de Weijer, Joost and Lopez, Antonio M. and Bagdanov, Andrew D)</a>", "<a href=\"http://arxiv.org/abs/1805.07810\">Online Structured Laplace Approximations For Overcoming Catastrophic Forgetting (Ritter, Hippolyt and Botev, Aleksandar and Barber, David)</a>", "<a href=\"https://arxiv.org/pdf/1801.01423.pdf\">Overcoming Catastrophic Forgetting with Hard Attention to the Task (Serrà, Joan and Surís, D\\d́ac and Miron, Marius and Karatzoglou, Alexandros)</a>", "<a href=\"http://arxiv.org/abs/1612.00796\">Overcoming Catastrophic Forgetting in Neural Networks (Kirkpatrick, James and Pascanu, Razvan and Rabinowitz, Neil and Veness, Joel and Desjardins, Guillaume and Rusu, Andrei A and Milan, Kieran and Quan, John and Ramalho, Tiago and Grabska-Barwinska, Agnieszka and Hassabis, Demis and Clopath, Claudia and Kumaran, Dharshan and Hadsell, Raia)</a>", "<a href=\"http://arxiv.org/abs/1703.08475\">Overcoming Catastrophic Forgetting by Incremental Moment Matching (Lee, Sang-Woo and Kim, Jin-Hwa and Jun, Jaehyun and Ha, Jung-Woo and Zhang, Byoung-Tak)</a>", "<a href=\"http://arxiv.org/abs/1705.09847\">Lifelong Generative Modeling (Ramapuram, Jason and Gregorova, Magda and Kalousis, Alexandros)</a>", "<a href=\"http://arxiv.org/abs/1705.08395\">Continual Learning in Generative Adversarial Nets (Seff, Ari and Beatson, Alex and Suo, Daniel and Liu, Han)</a>", "<a href=\"http://arxiv.org/abs/1708.06977\">Incremental Learning of Object Detectors without Catastrophic Forgetting (Shmelkov, Konstantin and Schmid, Cordelia and Alahari, Karteek)</a>", "<a href=\"http://proceedings.mlr.press/v70/zenke17a.html\">Continual Learning Through Synaptic Intelligence (Zenke, Friedemann and Poole, Ben and Ganguli, Surya)</a>", "<a href=\"http://arxiv.org/abs/1606.09282\">Learning without Forgetting (Li, Zhizhong and Hoiem, Derek)</a>", "<a href=\"http://arxiv.org/abs/2004.03794\">CALM: Continuous Adaptive Learning for Language Modeling (Arumae, Kristjan and Bhatia, Parminder)</a>", "<a href=\"http://arxiv.org/abs/2004.09578\">CLOPS: Continual Learning of Physiological Signals (Kiyasseh, Dani and Zhu, Tingting and Clifton, David A)</a>", "<a href=\"https://iclr.cc/virtual_2020/poster_SJlsFpVtDB.html\">Continual Learning with Bayesian Neural Networks for Non-Stationary Data (Kurle, Richard and Cseke, Botond and Klushyn, Alexej and van der Smagt, Patrick and Günnemann, Stephan)</a>", "<a href=\"https://openreview.net/forum?id=HHSEKOnPvaO\">Graph-Based Continual Learning (Tang, Binh and Matteson, David S.)</a>", "<a href=\"https://www.nature.com/articles/s41467-020-17866-2\">Brain-Inspired Replay for Continual Learning with Artificial Neural Networks (van de Ven, Gido M. and Siegelmann, Hava T. and Tolias, Andreas S.)</a>", "<a href=\"https://openreview.net/forum?id=SJgwNerKvB\">Continual Learning with Hypernetworks (von Oswald, Johannes and Henning, Christian and Sacramento, João and Grewe, Benjamin F)</a>", "<a href=\"http://papers.nips.cc/paper/9357-online-continual-learning-with-maximal-interfered-retrieval.pdf\">Online Continual Learning with Maximal Interfered Retrieval (Aljundi, Rahaf and Belilovsky, Eugene and Tuytelaars, Tinne and Charlin, Laurent and Caccia, Massimo and Lin, Min and Page-Caccia, Lucas)</a>", "<a href=\"https://github.com/facebookresearch/agem http://arxiv.org/abs/1902.10486\">On Tiny Episodic Memories in Continual Learning (Chaudhry, Arslan and Rohrbach, Marcus and Elhoseiny, Mohamed and Ajanthan, Thalaiyasingam and Dokania, Puneet K and Torr, Philip H S and Ranzato, Marc'Aurelio)</a>", "<a href=\"http://arxiv.org/abs/1904.10644\">Facilitating Bayesian Continual Learning by Natural Gradients and Stein Gradients (Chen, Yu and Diethe, Tom and Lawrence, Neil)</a>", "<a href=\"http://papers.nips.cc/paper/8327-experience-replay-for-continual-learning.pdf\">Experience Replay for Continual Learning (Rolnick, David and Ahuja, Arun and Schwarz, Jonathan and Lillicrap, Timothy P and Wayne, Greg)</a>", "<a href=\"http://arxiv.org/abs/1905.09447\">Prototype Reminding for Continual Learning (Zhang, Mengmi and Wang, Tao and Lim, Joo Hwee and Feng, Jiashi)</a>", "<a href=\"https://github.com/tyler-hayes/ExStream. http://arxiv.org/abs/1809.05922\">Memory Efficient Experience Replay for Streaming Learning (Hayes, Tyler L and Cahill, Nathan D and Kanan, Christopher)</a>", "<a href=\"http://arxiv.org/abs/1802.10269\">Selective Experience Replay for Lifelong Learning (Isele, David and Cosgun, Akansel)</a>", "<a href=\"http://leadserv.u-bourgogne.fr/IMG/pdf/CogSci2002.Rsrn.pdf\">Preventing Catastrophic Interference in  MultipleSequence Learning Using Coupled Reverberating Elman Networks (Ans, Bernard and Rousset, Stephane and French, Robert M. and Musca, Serban C.)</a>", "<a href=\"https://www.aclweb.org/anthology/2020.coling-main.574\">Continual Lifelong Learning in Natural Language Processing: A Survey (Biesialska, Magdalena and Biesialska, Katarzyna and Costa-jussà, Marta R.)</a>", "<a href=\"https://doi.org/10.1016/j.tics.2020.09.004\">Embracing Change: Continual Learning in Deep Neural Networks (Hadsell, Raia and Rao, Dushyant and Rusu, Andrei A and Pascanu, Razvan)</a>", "<a href=\"http://www.sciencedirect.com/science/article/pii/S1566253519307377\">Continual Learning for Robotics: Definition, Framework, Learning Strategies, Opportunities and Challenges (Lesort, Timothée and Lomonaco, Vincenzo and Stoian, Andrei and Maltoni, Davide and Filliat, David and Díaz-Rodr\\ǵuez, Natalia)</a>", "<a href=\"http://arxiv.org/abs/2009.01797\">A Wholistic View of Continual Learning with Deep Neural Networks: Forgotten Lessons and the Bridge to Active and Open World Learning (Mundt, Martin and Hong, Yong Won and Pliushch, Iuliia and Ramesh, Visvanathan)</a>", "<a href=\"https://ieeexplore.ieee.org/document/9141463/\">A Review of Off-Line Mode Dataset Shifts (Takahashi, Carla C. and Braga, Antonio P.)</a>", "<a href=\"https://dl.acm.org/doi/pdf/10.1145/3297001.3297062\">Continual Learning with Neural Networks: A Review (Awasthi, Abhijeet and Sarawagi, Sunita)</a>", "<a href=\"http://arxiv.org/abs/1909.08383\">A Continual Learning Survey: Defying Forgetting in Classification Tasks (De Lange, Matthias and Aljundi, Rahaf and Masana, Marc and Parisot, Sarah and Jia, Xu and Leonardis, Ales and Slabaugh, Gregory and Tuytelaars, Tinne)</a>", "<a href=\"http://www.sciencedirect.com/science/article/pii/S0893608019300231\">Continual Lifelong Learning with Neural Networks: A Review (Parisi, German I and Kemker, Ronald and Part, Jose L and Kanan, Christopher and Wermter, Stefan)</a>", "<a href=\"https://www.cs.uic.edu/ liub/lifelong-machine-learning.html\">Lifelong Machine Learning, Second Edition (Chen, Zhiyuan and Liu, Bing)</a>", "<a href=\"https://arxiv.org/pdf/1708.02072.pdf\">Measuring Catastrophic Forgetting in Neural Networks (Kemker, Ronald and McClure, Marc and Abitino, Angelina and Hayes, Tyler L and Kanan, Christopher)</a>", "<a href=\"http://arxiv.org/abs/1812.09111\">Generative Models from the Perspective of Continual Learning (Lesort, Timothée and Caselles-Dupré, Hugo and Garcia-Ortiz, Michael and Stoian, Andrei and Filliat, David)</a>", "<a href=\"https://doi.org/10.1016/j.neucom.2017.06.084\">Incremental On-Line Learning: A Review and Comparison of State of the Art Algorithms (Losing, Viktor and Hammer, Barbara and Wersing, Heiko)</a>", "<a href=\"https://openreview.net/pdf?id=BkloRs0qK7\">A Comprehensive, Application-Oriented Study of Catastrophic Forgetting in DNNs (Pfülb, B and Gepperth, A)</a>", "<a href=\"https://linkinghub.elsevier.com/retrieve/pii/S1364661317300736\">Avoiding Catastrophic Forgetting (Hasselmo, Michael E.)</a>", "<a href=\"http://ieeexplore.ieee.org/document/7296710/\">Learning in Nonstationary Environments: A Survey (Ditzler, Gregory and Roveri, Manuel and Alippi, Cesare and Polikar, Robi)</a>", "<a href=\"https://dl.acm.org/doi/10.1145/3191513\">Never-Ending Learning (Mitchell, Tom and Cohen, William W and Hruschka, E and Talukdar, Partha P and Yang, B and Betteridge, Justin and Carlson, Andrew and Dalvi, B and Gardner, Matt and Kisiel, Bryan and Krishnamurthy, J and Lao, Ni and Mazaitis, K and Mohamed, T and Nakashole, N and Platanios, E and Ritter, A and Samadi, M and Settles, B and Wang, R and Wijaya, D and Gupta, A and Chen, X and Saparov, A and Greaves, M and Welling, J)</a>", "<a href=\"http://www.tandfonline.com/doi/abs/10.1080/09540099550039318\">Catastrophic Forgetting; Catastrophic Interference; Stability; Plasticity; Rehearsal. (Robins, Anthony)</a>", "<a href=\"http://arxiv.org/abs/2008.00819\">Tell Me What This Is: Few-Shot Incremental Object Learning by a Robot (Ayub, Ali and Wagner, Alan R.)</a>", "<a href=\"https://arxiv.org/abs/1809.08722\">Online Object and Task Learning via Human Robot Interaction (Dehghan, M. and Zhang, Z. and Siam, M. and Jin, J. and Petrich, L. and Jagersand, M.)</a>", "<a href=\"http://arxiv.org/abs/1611.00201\">Towards Lifelong Self-Supervision: A Deep Learning Direction for Robotics (Wong, Jay M)</a>", "<a href=\"http://www.sciencedirect.com/science/article/pii/B9780444822505500153\">A Lifelong Learning Perspective for Mobile Robot Control (Thrun, Sebastian)</a>", "<a href=\"https://papers.nips.cc/paper/614-explanation-based-neural-network-learning-for-robot-control.pdf\">Explanation-Based Neural Network Learning for Robot Control (Mitchell, Tom M and Thrun, Sebastian B)</a>"], "sec_title": ["0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "2", "2", "2", "2", "2", "3", "3", "3", "3", "3", "3", "3", "3", "3", "3", "3", "3", "3", "3", "3", "3", "3", "3", "3", "3", "4", "4", "4", "4", "4", "4", "4", "5", "5", "5", "5", "5", "5", "5", "6", "6", "6", "6", "6", "6", "6", "7", "7", "7", "7", "8", "8", "8", "8", "8", "8", "8", "8", "8", "8", "8", "8", "8", "8", "8", "8", "8", "8", "8", "9", "9", "9", "9", "9", "9", "9", "9", "9", "9", "9", "9", "9", "9", "9", "9", "9", "9", "10", "10", "10", "10", "10", "10", "11", "11", "11", "11", "12", "12", "12", "12", "12", "12", "12", "12", "13", "13", "13", "13", "13", "13", "13", "13", "14", "14", "14", "14", "14", "14", "15", "15", "15", "15", "15", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "16", "17", "17", "17", "17", "17", "17", "17", "17", "17", "17", "17", "17", "17", "17", "17", "17", "17", "17", "17", "17", "17", "17", "18", "18", "18", "18", "18", "18", "18", "18", "18", "18", "18", "18", "18", "18", "19", "19", "19", "19", "19", "19", "19", "19", "19", "19", "19", "19", "19", "19", "19", "19", "19", "20", "20", "20", "20", "20"], "pos_x": [7.5004682540893555, -12.679722785949707, -6.558014869689941, -1.035630226135254, 3.237795352935791, 15.303363800048828, 3.9826531410217285, 4.7026777267456055, -11.244317054748535, 14.907137870788574, 7.884863376617432, 14.54112434387207, 5.34410285949707, 8.867661476135254, 5.041504859924316, -10.358086585998535, 5.057968616485596, -6.109858989715576, 18.293020248413086, 6.745166778564453, -11.648600578308105, 5.023111820220947, 5.864932537078857, 20.14206886291504, -14.749408721923828, -13.724106788635254, 7.910007953643799, 7.769683361053467, 1.532740592956543, -11.201848983764648, 4.328862190246582, -3.080071210861206, 6.685431003570557, 8.952058792114258, 20.602163314819336, -0.3094325661659241, 12.577467918395996, -16.75897979736328, 8.588634490966797, -15.918858528137207, 9.174309730529785, -4.322117328643799, -15.749897956848145, 13.015056610107422, -11.792064666748047, 8.517232894897461, -17.81571388244629, -18.09234046936035, -20.45296859741211, -5.411044597625732, -5.680037498474121, 12.38870620727539, 4.638510704040527, 3.3773059844970703, 13.632811546325684, -14.930174827575684, -1.1790529489517212, 14.34182357788086, -8.284533500671387, 13.96170711517334, -2.744544744491577, 16.47219467163086, 18.581491470336914, 8.314496040344238, -11.642936706542969, 9.806623458862305, -7.442058086395264, -9.190113067626953, 8.912216186523438, -9.329398155212402, -21.26656723022461, -4.038429260253906, -3.2051186561584473, 10.31816577911377, 23.62786865234375, -11.40960693359375, 20.053525924682617, 1.2704966068267822, -0.11673406511545181, 12.723520278930664, -9.5211820602417, 3.7741756439208984, 9.03764820098877, 11.518656730651855, 1.2609130144119263, -17.813779830932617, -0.4603477418422699, -8.547419548034668, -1.527097225189209, -6.787043571472168, 2.662426471710205, 1.0897159576416016, -2.8662526607513428, -9.418951034545898, 10.865185737609863, -7.753693580627441, -14.384149551391602, -18.629287719726562, -2.252084732055664, -10.145913124084473, 20.83660316467285, 10.783084869384766, -5.999166965484619, -7.928154945373535, 4.510204315185547, 21.305809020996094, 12.670974731445312, -6.169692516326904, -16.271242141723633, -10.985318183898926, 15.429302215576172, -15.721696853637695, 12.949409484863281, 12.090888023376465, -9.274113655090332, 5.02330207824707, 1.9089027643203735, 19.652099609375, -0.9909618496894836, 18.648866653442383, 1.6276497840881348, 14.658235549926758, -18.610233306884766, -10.377020835876465, -15.455760955810547, 10.860027313232422, -13.685240745544434, 7.073099136352539, -2.6860358715057373, -9.705506324768066, -16.22517967224121, 10.904921531677246, 13.327719688415527, -20.526933670043945, 0.623991847038269, 0.13217003643512726, 20.1897029876709, 4.039703369140625, -9.221948623657227, -15.342144012451172, 0.1892801821231842, -8.748160362243652, -3.303147077560425, -20.73402214050293, -4.636919975280762, 15.754878997802734, -20.931900024414062, -2.6350674629211426, -8.748159408569336, -1.6069782972335815, -16.2721004486084, 26.922513961791992, 14.890164375305176, 18.676937103271484, -4.088205337524414, 4.401872634887695, -15.353076934814453, -6.00109338760376, -7.774742126464844, -2.861874580383301, -14.579316139221191, -1.7897413969039917, 16.687211990356445, 20.22800636291504, -3.206780195236206, 14.862059593200684, -21.12858772277832, -0.1349991261959076, 10.677149772644043, 14.30507755279541, -0.11234287917613983, 11.35684585571289, -3.278444528579712, 7.7767558097839355, -1.426432490348816, -2.157531976699829, 14.316482543945312, 20.382049560546875, 9.118091583251953, 8.757713317871094, 4.562526226043701, 18.821962356567383, 5.525704860687256, -10.994675636291504, -6.069771766662598, -10.314531326293945, 7.665419101715088, 6.157443046569824, -2.096776008605957, -8.139912605285645, -3.229569435119629, -3.1372594833374023, -22.311155319213867, -1.1342142820358276, -1.522672176361084, -8.46141529083252, -4.070116996765137, -13.991713523864746, -17.584135055541992, 1.5750701427459717, 1.8652348518371582, -4.380424976348877, -3.952723979949951, -8.683538436889648, 7.122313976287842, -6.68057107925415, -19.83232307434082, -7.145336151123047, 0.19966907799243927, 0.7830166220664978, -7.414485454559326, 19.218740463256836, -4.395854473114014, 9.77500057220459, -11.014883995056152, -13.049510955810547, -3.817143201828003, -8.091215133666992, -0.33940911293029785, 6.666226387023926, -4.4783034324646, 6.948123455047607, 15.28674030303955, 1.6249200105667114, 18.039140701293945, -15.647719383239746, -19.88008689880371, -10.377020835876465, 5.291105270385742, -13.573016166687012, -7.9376068115234375, 1.6027991771697998, -0.9332020878791809, 4.492259979248047, 10.535445213317871, 8.893898963928223, 23.73828887939453, -20.67559242248535, 8.605276107788086, 2.1350536346435547, 2.9350712299346924, 12.714505195617676, 18.97705841064453, 3.65872859954834, -12.05390739440918, -10.52977180480957, 2.0475990772247314, -13.704530715942383, 21.19721794128418, 1.2563635110855103, 1.705768346786499, 8.034638404846191, -0.46474185585975647, -7.616944313049316, -21.12372589111328, 3.6869757175445557, 4.75294303894043], "pos_y": [17.03490447998047, 15.058466911315918, -6.082932949066162, 0.9236777424812317, -6.537930965423584, -21.13750648498535, -22.268768310546875, -21.415058135986328, 8.648042678833008, 7.544035911560059, 15.75445556640625, 7.679508686065674, 5.218318462371826, 15.236812591552734, -3.265235185623169, 5.322027206420898, -20.640897750854492, 0.19716289639472961, 10.029468536376953, -2.4955482482910156, 5.13126277923584, -15.776707649230957, -0.4687472879886627, 10.109389305114746, 0.6211307644844055, -6.8791422843933105, -20.258901596069336, -11.533451080322266, -13.889388084411621, 2.504060983657837, 2.679342031478882, 8.728682518005371, 18.17197608947754, -12.836787223815918, -0.41515877842903137, -7.187917232513428, -6.418972492218018, 4.488346099853516, -9.12716007232666, -2.5231261253356934, -5.983898162841797, -19.007429122924805, -10.986928939819336, -16.239376068115234, 1.815574288368225, 2.0496833324432373, 12.743610382080078, -2.3076834678649902, -7.6596856117248535, 15.807825088500977, 15.742630004882812, -10.205038070678711, 9.247428894042969, 19.1853084564209, -10.660523414611816, -16.62489891052246, -3.4136312007904053, -5.786996841430664, -10.967175483703613, -11.468533515930176, 8.834817886352539, -8.243884086608887, -3.633727788925171, -5.623669624328613, -8.317622184753418, 6.424881935119629, -9.934659004211426, -16.588552474975586, -8.471016883850098, -16.946210861206055, 6.674261569976807, -18.49278450012207, -6.835373878479004, -1.4421669244766235, 4.441839694976807, -8.607634544372559, -8.675480842590332, -17.319805145263672, 10.914182662963867, 13.468827247619629, -23.598432540893555, 1.773078441619873, 11.236295700073242, -5.70848274230957, -17.293561935424805, 12.745964050292969, 6.34562349319458, 3.4207334518432617, -1.300716757774353, 0.4606529474258423, -6.765237808227539, -5.054873943328857, 1.6351428031921387, 4.780007839202881, 21.234039306640625, 1.3165888786315918, 8.883456230163574, 5.608214378356934, 17.45012855529785, -12.553726196289062, -1.6049796342849731, 6.18956995010376, 4.628316402435303, -2.57700777053833, -12.238626480102539, 1.779280662536621, -0.7892000675201416, -5.78206205368042, 19.14475440979004, -1.1197919845581055, -9.477432250976562, -10.989290237426758, -16.274946212768555, 2.012551784515381, -23.6339054107666, -15.780068397521973, -2.4959917068481445, 5.137669086456299, 14.142409324645996, 16.842557907104492, 8.33181095123291, 5.1346330642700195, -2.0934555530548096, -4.821831226348877, 3.1288557052612305, 21.240509033203125, 8.12552547454834, 2.8573639392852783, 22.489076614379883, -12.119586944580078, 3.9723174571990967, 10.368657112121582, 13.172041893005371, 2.758798122406006, 3.3346080780029297, 2.782872438430786, -9.25523853302002, 11.850464820861816, -22.32257080078125, -17.726377487182617, -3.9332027435302734, 21.317047119140625, 5.588869094848633, -6.624576568603516, -11.136124610900879, 1.7853713035583496, -5.864227294921875, 22.47187614440918, 21.317047119140625, -14.371048927307129, 19.18905258178711, -6.768052577972412, -3.0516695976257324, 16.840831756591797, 2.2149670124053955, -3.504565954208374, 1.6243056058883667, 4.631940841674805, -14.47846794128418, 1.6344857215881348, -7.574787139892578, 17.006540298461914, 0.9646069407463074, -10.762928009033203, 5.464972496032715, -3.679741621017456, 7.214440822601318, 10.894989967346191, -1.3883990049362183, 12.491965293884277, 16.36486053466797, -4.537359714508057, -17.364574432373047, 0.8505606055259705, -9.918147087097168, -9.429153442382812, 3.4616901874542236, -5.830151557922363, 2.32523512840271, -14.037075996398926, 4.881818771362305, 5.34970235824585, -8.681693077087402, 15.992863655090332, 7.9602370262146, 8.341384887695312, 7.271486759185791, 14.999652862548828, -14.12832260131836, 12.122529029846191, -6.184178829193115, -13.03781509399414, -0.4604019820690155, -21.21061897277832, -21.047075271606445, 13.118921279907227, 11.941071510314941, -3.715071201324463, -5.001825332641602, -10.216793060302734, -9.71682357788086, -2.584146738052368, -1.8718734979629517, 8.371212005615234, -4.237153053283691, -13.883896827697754, -14.274101257324219, 9.356372833251953, -7.377631664276123, -11.928254127502441, 10.684999465942383, 10.110946655273438, 11.826934814453125, -12.435664176940918, -1.134198546409607, 11.033365249633789, -4.251376628875732, 14.440041542053223, -11.075801849365234, -0.6139087080955505, -12.615768432617188, -19.599403381347656, -21.14158058166504, 8.33540153503418, 0.12691570818424225, -17.561084747314453, -14.337244987487793, -4.821831226348877, -8.190987586975098, -4.036713600158691, -2.5649335384368896, -3.039764881134033, 14.780802726745605, -12.223015785217285, 10.630867004394531, -20.357912063598633, 4.701607704162598, 2.0147173404693604, 6.839068412780762, 0.22422188520431519, 19.257326126098633, 2.9088294506073, -3.622464179992676, 5.179922103881836, -13.008329391479492, 16.239633560180664, -0.22165177762508392, 9.130756378173828, 0.8762397170066833, 14.480424880981445, 3.884904384613037, 11.187238693237305, 6.339254379272461, -6.838405132293701, 0.28679051995277405, 12.324169158935547, 10.702005386352539]}